[{"source":"Twitter for iPhone","text":"“The highest level of bias I’ve ever witnessed in any law enforcement officer.” Trey Gowdy on the FBI’s own, Peter Strzok. Also remember that they all worked for Slippery James Comey and that Comey is best friends with Robert Mueller. A really sick deal, isn’t it?","created_at":"Mon Jun 18 01:03:52 +0000 2018","retweet_count":26845,"favorite_count":100961,"is_retweet":false,"id_str":"1008515606751084544"},{"source":"Twitter for iPhone","text":"The Democrats should get together with their Republican counterparts and work something out on Border Security & Safety. Don’t wait until after the election because you are going to lose!","created_at":"Mon Jun 18 00:49:01 +0000 2018","retweet_count":19405,"favorite_count":85653,"is_retweet":false,"id_str":"1008511869970255872"},{"source":"Twitter for iPhone","text":"Why was the FBI’s sick loser, Peter Strzok, working on the totally discredited Mueller team of 13 Angry & Conflicted Democrats, when Strzok was giving Crooked Hillary a free pass yet telling his lover, lawyer Lisa Page, that “we’ll stop” Trump from becoming President? Witch Hunt!","created_at":"Mon Jun 18 00:42:04 +0000 2018","retweet_count":20615,"favorite_count":80398,"is_retweet":false,"id_str":"1008510118395293699"},{"source":"Twitter for iPhone","text":"Why was the FBI giving so much information to the Fake News Media. They are not supposed to be doing that, and knowing the enemy of the people Fake News, they put their own spin on it - truth doesn’t matter to them!","created_at":"Mon Jun 18 00:25:53 +0000 2018","retweet_count":23842,"favorite_count":97507,"is_retweet":false,"id_str":"1008506045373845504"},{"source":"Twitter for iPhone","text":"RT @WhiteHouse: Happy Father's Day! https://t.co/1Legof68lb","created_at":"Sun Jun 17 16:55:13 +0000 2018","retweet_count":11166,"favorite_count":0,"is_retweet":true,"id_str":"1008392634468093955"},{"source":"Twitter for iPhone","text":"WITCH HUNT! There was no Russian Collusion. Oh, I see, there was no Russian Collusion, so now they look for obstruction on the no Russian Collusion. The phony Russian Collusion was a made up Hoax. Too bad they didn’t look at Crooked Hillary like this. Double Standard!","created_at":"Sun Jun 17 14:54:53 +0000 2018","retweet_count":29942,"favorite_count":122336,"is_retweet":false,"id_str":"1008362351807037441"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: The IG Report totally destroys James Comey and all of his minions including the great lovers, Peter Strzok and Lisa Pa…","created_at":"Sun Jun 17 14:37:03 +0000 2018","retweet_count":29830,"favorite_count":0,"is_retweet":true,"id_str":"1008357861599129600"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: My supporters are the smartest, strongest, most hard working and most loyal that we have seen in our countries history…","created_at":"Sun Jun 17 14:36:44 +0000 2018","retweet_count":42441,"favorite_count":0,"is_retweet":true,"id_str":"1008357782410711041"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: Democrats can fix their forced family breakup at the Border by working with Republicans on new legislation, for a chan…","created_at":"Sun Jun 17 14:36:35 +0000 2018","retweet_count":30008,"favorite_count":0,"is_retweet":true,"id_str":"1008357746683580417"},{"source":"Twitter for iPhone","text":"RT @realDonaldTrump: I’ve had to beat 17 very talented people including the Bush Dynasty, then I had to beat the Clinton Dynasty, and now I…","created_at":"Sun Jun 17 14:36:08 +0000 2018","retweet_count":37215,"favorite_count":0,"is_retweet":true,"id_str":"1008357631721951234"},{"source":"Twitter for iPhone","text":"Washington Post employees want to go on strike because Bezos isn’t paying them enough. I think a really long strike would be a great idea. Employees would get more money and we would get rid of Fake News for an extended period of time! Is @WaPo a registered lobbyist?","created_at":"Sun Jun 17 13:26:28 +0000 2018","retweet_count":16316,"favorite_count":68616,"is_retweet":false,"id_str":"1008340100877570048"},{"source":"Twitter for iPhone","text":"Our economy is perhaps BETTER than it has ever been. Companies doing really well, and moving back to America, and jobs numbers are the best in 44 years.","created_at":"Sun Jun 17 13:08:26 +0000 2018","retweet_count":15412,"favorite_count":80164,"is_retweet":false,"id_str":"1008335560988078080"},{"source":"Twitter for iPhone","text":"The denuclearization deal with North Korea is being praised and celebrated all over Asia. They are so happy! Over here, in our country, some people would rather see this historic deal fail than give Trump a win, even if it does save potentially millions & millions of lives!","created_at":"Sun Jun 17 13:01:06 +0000 2018","retweet_count":18443,"favorite_count":77392,"is_retweet":false,"id_str":"1008333717545410560"},{"source":"Twitter for iPhone","text":"Holding back the “war games” during the negotiations was my request because they are VERY EXPENSIVE and set a bad light during a good faith negotiation. Also, quite provocative. Can start up immediately if talks break down, which I hope will not happen!","created_at":"Sun Jun 17 12:48:43 +0000 2018","retweet_count":14854,"favorite_count":73765,"is_retweet":false,"id_str":"1008330598363090944"},{"source":"Twitter for iPhone","text":"Funny how the Fake News, in a coordinated effort with each other, likes to say I gave sooo much to North Korea because I “met.” That’s because that’s all they have to disparage! We got so much for peace in the world, & more is being added in finals. Even got our hostages/remains!","created_at":"Sun Jun 17 12:40:02 +0000 2018","retweet_count":16892,"favorite_count":76649,"is_retweet":false,"id_str":"1008328413210398720"},{"source":"Twitter for iPhone","text":"Daniel Henninger of The Wall Street Journal: “This IG Report makes it clear, as did Rod Rosenstein’s memo, that Trump was absolutely justified, unquestionably justified, in firing Jim Comey. So I think the Mueller Investigation is on pretty weak grounds right now.” Witch Hunt!","created_at":"Sun Jun 17 12:31:46 +0000 2018","retweet_count":16906,"favorite_count":68740,"is_retweet":false,"id_str":"1008326335083761664"},{"source":"Twitter for iPhone","text":"Please clear up the Fake News! https://t.co/3VbIKbmKwP","created_at":"Sun Jun 17 11:58:01 +0000 2018","retweet_count":12104,"favorite_count":50454,"is_retweet":false,"id_str":"1008317842264088576"},{"source":"Twitter for iPhone","text":"Chuck Schumer said “the Summit was what the Texans call all cattle and no hat.” Thank you Chuck, but are you sure you got that right? No more nuclear testing or rockets flying all over the place, blew up launch sites. Hostages already back, hero remains coming home & much more!","created_at":"Sun Jun 17 11:52:40 +0000 2018","retweet_count":19320,"favorite_count":83047,"is_retweet":false,"id_str":"1008316495733186560"}]